espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG1P/Include/efr32bg1p_emu.h
/* Bit fields for EMU VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_RESETVALUE                  0x00000000UL                                 /**< Default value for EMU_VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_MASK                        0x0000FF1DUL                                 /**< Mask for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_EN                           (0x1UL << 0)                                 /**< Enable */
#define _EMU_VMONIO0CTRL_EN_SHIFT                    0                                            /**< Shift value for EMU_EN */
#define _EMU_VMONIO0CTRL_EN_MASK                     0x1UL                                        /**< Bit mask for EMU_EN */
#define _EMU_VMONIO0CTRL_EN_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_EN_DEFAULT                   (_EMU_VMONIO0CTRL_EN_DEFAULT << 0)           /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RISEWU                       (0x1UL << 2)                                 /**< Rise Wakeup */
#define _EMU_VMONIO0CTRL_RISEWU_SHIFT                2                                            /**< Shift value for EMU_RISEWU */
#define _EMU_VMONIO0CTRL_RISEWU_MASK                 0x4UL                                        /**< Bit mask for EMU_RISEWU */
#define _EMU_VMONIO0CTRL_RISEWU_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RISEWU_DEFAULT               (_EMU_VMONIO0CTRL_RISEWU_DEFAULT << 2)       /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_FALLWU                       (0x1UL << 3)                                 /**< Fall Wakeup */
#define _EMU_VMONIO0CTRL_FALLWU_SHIFT                3                                            /**< Shift value for EMU_FALLWU */
#define _EMU_VMONIO0CTRL_FALLWU_MASK                 0x8UL                                        /**< Bit mask for EMU_FALLWU */
#define _EMU_VMONIO0CTRL_FALLWU_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_FALLWU_DEFAULT               (_EMU_VMONIO0CTRL_FALLWU_DEFAULT << 3)       /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RETDIS                       (0x1UL << 4)                                 /**< EM4 IO0 Retention Disable */
#define _EMU_VMONIO0CTRL_RETDIS_SHIFT                4                                            /**< Shift value for EMU_RETDIS */
#define _EMU_VMONIO0CTRL_RETDIS_MASK                 0x10UL                                       /**< Bit mask for EMU_RETDIS */
#define _EMU_VMONIO0CTRL_RETDIS_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_RETDIS_DEFAULT               (_EMU_VMONIO0CTRL_RETDIS_DEFAULT << 4)       /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_THRESFINE_SHIFT             8                                            /**< Shift value for EMU_THRESFINE */
#define _EMU_VMONIO0CTRL_THRESFINE_MASK              0xF00UL                                      /**< Bit mask for EMU_THRESFINE */
#define _EMU_VMONIO0CTRL_THRESFINE_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_THRESFINE_DEFAULT            (_EMU_VMONIO0CTRL_THRESFINE_DEFAULT << 8)    /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */
#define _EMU_VMONIO0CTRL_THRESCOARSE_SHIFT           12                                           /**< Shift value for EMU_THRESCOARSE */
#define _EMU_VMONIO0CTRL_THRESCOARSE_MASK            0xF000UL                                     /**< Bit mask for EMU_THRESCOARSE */
#define _EMU_VMONIO0CTRL_THRESCOARSE_DEFAULT         0x00000000UL                                 /**< Mode DEFAULT for EMU_VMONIO0CTRL */
#define EMU_VMONIO0CTRL_THRESCOARSE_DEFAULT          (_EMU_VMONIO0CTRL_THRESCOARSE_DEFAULT << 12) /**< Shifted mode DEFAULT for EMU_VMONIO0CTRL */

/* Bit fields for EMU BIASCONF */
#define _EMU_BIASCONF_RESETVALUE                     0x000000F8UL                            /**< Default value for EMU_BIASCONF */
#define _EMU_BIASCONF_MASK                           0x000000FCUL                            /**< Mask for EMU_BIASCONF */
#define EMU_BIASCONF_NADUTYEM01                      (0x1UL << 2)                            /**< NA DUTY in EM01 */
#define _EMU_BIASCONF_NADUTYEM01_SHIFT               2                                       /**< Shift value for EMU_NADUTYEM01 */
#define _EMU_BIASCONF_NADUTYEM01_MASK                0x4UL                                   /**< Bit mask for EMU_NADUTYEM01 */
#define _EMU_BIASCONF_NADUTYEM01_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_NADUTYEM01_DEFAULT              (_EMU_BIASCONF_NADUTYEM01_DEFAULT << 2) /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_LPEM01                          (0x1UL << 3)                            /**< LP in EM01 */
#define _EMU_BIASCONF_LPEM01_SHIFT                   3                                       /**< Shift value for EMU_LPEM01 */
#define _EMU_BIASCONF_LPEM01_MASK                    0x8UL                                   /**< Bit mask for EMU_LPEM01 */
#define _EMU_BIASCONF_LPEM01_DEFAULT                 0x00000001UL                            /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_LPEM01_DEFAULT                  (_EMU_BIASCONF_LPEM01_DEFAULT << 3)     /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_GMCEM23                         (0x1UL << 4)                            /**< GMC in EM234 */
#define _EMU_BIASCONF_GMCEM23_SHIFT                  4                                       /**< Shift value for EMU_GMCEM23 */
#define _EMU_BIASCONF_GMCEM23_MASK                   0x10UL                                  /**< Bit mask for EMU_GMCEM23 */
#define _EMU_BIASCONF_GMCEM23_DEFAULT                0x00000001UL                            /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_GMCEM23_DEFAULT                 (_EMU_BIASCONF_GMCEM23_DEFAULT << 4)    /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_UADUTYEM23                      (0x1UL << 5)                            /**< UADUTY in EM234 */
#define _EMU_BIASCONF_UADUTYEM23_SHIFT               5                                       /**< Shift value for EMU_UADUTYEM23 */
#define _EMU_BIASCONF_UADUTYEM23_MASK                0x20UL                                  /**< Bit mask for EMU_UADUTYEM23 */
#define _EMU_BIASCONF_UADUTYEM23_DEFAULT             0x00000001UL                            /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_UADUTYEM23_DEFAULT              (_EMU_BIASCONF_UADUTYEM23_DEFAULT << 5) /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_NADUTYEM23                      (0x1UL << 6)                            /**< NA DUTY in EM234 */
#define _EMU_BIASCONF_NADUTYEM23_SHIFT               6                                       /**< Shift value for EMU_NADUTYEM23 */
#define _EMU_BIASCONF_NADUTYEM23_MASK                0x40UL                                  /**< Bit mask for EMU_NADUTYEM23 */
#define _EMU_BIASCONF_NADUTYEM23_DEFAULT             0x00000001UL                            /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_NADUTYEM23_DEFAULT              (_EMU_BIASCONF_NADUTYEM23_DEFAULT << 6) /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_LPEM23                          (0x1UL << 7)                            /**< LP in EM234 */
#define _EMU_BIASCONF_LPEM23_SHIFT                   7                                       /**< Shift value for EMU_LPEM23 */
#define _EMU_BIASCONF_LPEM23_MASK                    0x80UL                                  /**< Bit mask for EMU_LPEM23 */
#define _EMU_BIASCONF_LPEM23_DEFAULT                 0x00000001UL                            /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_LPEM23_DEFAULT                  (_EMU_BIASCONF_LPEM23_DEFAULT << 7)     /**< Shifted mode DEFAULT for EMU_BIASCONF */

/* Bit fields for EMU TESTLOCK */
#define _EMU_TESTLOCK_RESETVALUE                     0x00000000UL                          /**< Default value for EMU_TESTLOCK */
#define _EMU_TESTLOCK_MASK                           0x0000FFFFUL                          /**< Mask for EMU_TESTLOCK */
#define _EMU_TESTLOCK_LOCKKEY_SHIFT                  0                                     /**< Shift value for EMU_LOCKKEY */
#define _EMU_TESTLOCK_LOCKKEY_MASK                   0xFFFFUL                              /**< Bit mask for EMU_LOCKKEY */
#define _EMU_TESTLOCK_LOCKKEY_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for EMU_TESTLOCK */
#define _EMU_TESTLOCK_LOCKKEY_UNLOCKED               0x00000000UL                          /**< Mode UNLOCKED for EMU_TESTLOCK */
#define _EMU_TESTLOCK_LOCKKEY_LOCK                   0x00000000UL                          /**< Mode LOCK for EMU_TESTLOCK */
#define _EMU_TESTLOCK_LOCKKEY_LOCKED                 0x00000001UL                          /**< Mode LOCKED for EMU_TESTLOCK */
#define _EMU_TESTLOCK_LOCKKEY_UNLOCK                 0x0000ADE8UL                          /**< Mode UNLOCK for EMU_TESTLOCK */
#define EMU_TESTLOCK_LOCKKEY_DEFAULT                 (_EMU_TESTLOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for EMU_TESTLOCK */
#define EMU_TESTLOCK_LOCKKEY_UNLOCKED                (_EMU_TESTLOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for EMU_TESTLOCK */
#define EMU_TESTLOCK_LOCKKEY_LOCK                    (_EMU_TESTLOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for EMU_TESTLOCK */
#define EMU_TESTLOCK_LOCKKEY_LOCKED                  (_EMU_TESTLOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for EMU_TESTLOCK */
#define EMU_TESTLOCK_LOCKKEY_UNLOCK                  (_EMU_TESTLOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for EMU_TESTLOCK */

/* Bit fields for EMU BIASTESTCTRL */
#define _EMU_BIASTESTCTRL_RESETVALUE                 0x00000000UL                                    /**< Default value for EMU_BIASTESTCTRL */
#define _EMU_BIASTESTCTRL_MASK                       0x00000008UL                                    /**< Mask for EMU_BIASTESTCTRL */
#define EMU_BIASTESTCTRL_BIAS_RIP_RESET              (0x1UL << 3)                                    /**< Reset Bias Ripple Counter */
#define _EMU_BIASTESTCTRL_BIAS_RIP_RESET_SHIFT       3                                               /**< Shift value for EMU_BIAS_RIP_RESET */
#define _EMU_BIASTESTCTRL_BIAS_RIP_RESET_MASK        0x8UL                                           /**< Bit mask for EMU_BIAS_RIP_RESET */
#define _EMU_BIASTESTCTRL_BIAS_RIP_RESET_DEFAULT     0x00000000UL                                    /**< Mode DEFAULT for EMU_BIASTESTCTRL */
#define EMU_BIASTESTCTRL_BIAS_RIP_RESET_DEFAULT      (_EMU_BIASTESTCTRL_BIAS_RIP_RESET_DEFAULT << 3) /**< Shifted mode DEFAULT for EMU_BIASTESTCTRL */

/** @} */
/** @} End of group EFR32BG1P_EMU */
/** @} End of group Parts */
